# Project 3 Alternate Assignment
### Given a text file with structured table information, manipulate the data while creating a Jupyter Notebook that generates a .CSV file with meaningful information. 
### I have chosen a text file which contains salary data for men and women. The data is somewhat structured in a table format, but with a few complications that we'll have to work out. 
### First we will read in the data as a .csv. One of the problems with the data is the columns are separated only by spaces, and not by the same number of spaces. So when we read in the data, I use delimiter=r"\s+" so that the separator is any amount of white space.

In [89]:
import pandas as pd

data = pd.read_csv('salarygapdata.txt', header=None, delimiter=r"\s+")
data.head()

        0     1   2          3   4      5
0      sx    rk  yr         dg  yd     sl
1    male  full  25  doctorate  35  36350
2    male  full  13  doctorate  22  35350
3    male  full  10  doctorate  23  28200
4  female  full   7  doctorate  27  26775

### As you can see above, I have successfully separated the columns, but now my columns are only index numbers. So next I will rename the columns, and delete that first row.

In [90]:
data.columns = ['Sex', 'Rank', 'Years_in_Rank', 'Degree', 'Degree_Age', 'Salary']
data.drop([0], inplace=True)
data.head()

      Sex  Rank Years_in_Rank     Degree Degree_Age Salary
1    male  full            25  doctorate         35  36350
2    male  full            13  doctorate         22  35350
3    male  full            10  doctorate         23  28200
4  female  full             7  doctorate         27  26775
5    male  full            19    masters         30  33696

### Now we can start to work with the data. In order to manipulate the numerical field, we have to convert from object to int. Here we confirm, this column has been stored as an object.

In [91]:
data.Salary.head()

1    36350
2    35350
3    28200
4    26775
5    33696
Name: Salary, dtype: object

In [98]:
#convert the salary column to data type int
data['Salary'] = data['Salary'].apply(pd.to_numeric)
data.Salary.head()
#data.groupby(['Sex', 'Degree']).Salary.mean()

1    36350
2    35350
3    28200
4    26775
5    33696
Name: Salary, dtype: int64

In [ ]:
data.Salary.mean

In [94]:
### Now we have something that we can work with. I'll write this data into a .csv file using dataframe.to_csv
# add a column to the dataframe to calculate the difference in salary for each person to the average salary of the opposite gender with the same degree and number of years in rank
#Add an average difference column
avgdiff = data.copy()
avgdiff['Average_Difference'] = avgdiff.mean(numeric_only=True, axis=1)
avgdiff.head()

#df_csv['to new column'] = df['from single column']

,Sex,Rank,Years_in_Rank,Degree,Degree_Age,Salary,Average_Difference
1,male,full,25,doctorate,35,36350,36350.0
2,male,full,13,doctorate,22,35350,35350.0
3,male,full,10,doctorate,23,28200,28200.0
4,female,full,7,doctorate,27,26775,26775.0
5,male,full,19,masters,30,33696,33696.0

In [94]:
### Now we have something that we can work with. I'll write this data into a .csv file using dataframe.to_csv
# add a column to the dataframe to calculate the difference in salary for each person to the average salary of the opposite gender with the same degree and number of years in rank
#Add an average difference column
avgdiff = data.copy()
avgdiff['Average_Difference'] = data
avgdiff.head()

#df_csv['to new column'] = df['from single column']

,Sex,Rank,Years_in_Rank,Degree,Degree_Age,Salary,Average_Difference
1,male,full,25,doctorate,35,36350,36350.0
2,male,full,13,doctorate,22,35350,35350.0
3,male,full,10,doctorate,23,28200,28200.0
4,female,full,7,doctorate,27,26775,26775.0
5,male,full,19,masters,30,33696,33696.0

In [104]:
data.groupby(['Sex','Years_in_Rank']).Salary.mean()

Sex     Years_in_Rank
female  0                22600.000000
        1                15843.000000
        10               21600.000000
        2                15750.000000
        3                17250.000000
        4                20690.000000
        5                25500.000000
        6                22450.000000
        7                26775.000000
        8                28174.500000
male    0                20999.000000
        1                18547.000000
        10               25553.000000
        11               24280.666667
        12               27025.000000
        13               32791.000000
        15               24750.000000
        16               26533.333333
        19               33696.000000
        2                16297.000000
        25               36350.000000
        3                21495.500000
        4                17131.666667
        5                25400.000000
        6                24450.000000
        7                28650.500000
        8                20525.000000
        9                25241.000000
Name: Salary, dtype: float64

In [106]:
avgdiff.to_csv('SalaryData.csv')
avgdiff.head()

,Sex,Rank,Years_in_Rank,Degree,Degree_Age,Salary,Average_Difference
1,male,full,25,doctorate,35,36350,36350.0
2,male,full,13,doctorate,22,35350,35350.0
3,male,full,10,doctorate,23,28200,28200.0
4,female,full,7,doctorate,27,26775,26775.0
5,male,full,19,masters,30,33696,33696.0

In [60]:

data.to_csv('test.csv')

   Unnamed: 0     Sex  Rank  Year     Degree  Degree_Age  Salary
0           1    male  full    25  doctorate          35   36350
1           2    male  full    13  doctorate          22   35350
2           3    male  full    10  doctorate          23   28200
3           4  female  full     7  doctorate          27   26775
4           5    male  full    19    masters          30   33696

In [62]:
#read in the csv file
newfile = pd.read_csv('test.csv')
newfile.groupby(['Sex', 'Degree']).Salary.mean()

Sex     Degree
female  doctorate    20936.000000
        masters      22410.000000
male    doctorate    24568.833333
        masters      24916.142857
Name: Salary, dtype: float64

In [ ]:

#data.drop(data.columns[0], axis=0, inplace=True)

In [52]:
### Let's see what the salary gap is at each level.

      Sex  Rank Year     Degree Degree_Age Salary
1    male  full   25  doctorate         35  36350
2    male  full   13  doctorate         22  35350
3    male  full   10  doctorate         23  28200
4  female  full    7  doctorate         27  26775
5    male  full   19    masters         30  33696

In [52]:
### Let's see what the salary gap is at each level.

      Sex  Rank Year     Degree Degree_Age Salary
1    male  full   25  doctorate         35  36350
2    male  full   13  doctorate         22  35350
3    male  full   10  doctorate         23  28200
4  female  full    7  doctorate         27  26775
5    male  full   19    masters         30  33696

# import pandas as pd

data = pd.read_csv('salarygapdata.txt', delimiter="\t")

data.head()